[{"url":"6eFd7JB9WH4","name":"Incline Hammer Curls","wanted":1,"mg":0,"rep":8,"set":3,"weight":20,"muscle":0,"steps":["Seat yourself on an incline bench with a dumbbell in each hand. You should pressed firmly against he back with your feet together. Allow the dumbbells to hang straight down at your side, holding them with a neutral grip. This will be your starting position.","Initiate the movement by flexing at the elbow, attempting to keep the upper arm stationary.","Continue to the top of the movement and pause, then slowly return to the start position."]},
{"url":"mp61xNRZcrk","name":"Finger Curls","wanted":1,"mg":0,"rep":8,"set":3,"weight":20,"muscle":0,"steps":["Hold a barbell with both hands and your palms facing up; hands spaced about shoulder width.","Place your feet flat on the floor, at a distance that is slightly wider than shoulder width apart. This will be your starting position.","Lower the bar as far as possible by extending the fingers. Allowing the bar to roll down the hands, catch the bar with the final joint in the fingers.","Now curl bar up as high as possible by closing your hands while exhaling. Hold the contraction at the top."]},
{"url":"sM6XUdt1rm4","name":"Dips","wanted":1,"mg":0,"rep":8,"set":3,"weight":20,"muscle":0,"steps":["To get into the starting position, hold your body at arm's length with your arms nearly locked above the bars.","Now, inhale and slowly lower yourself downward. Your torso should remain upright and your elbows should stay close to your body. This helps to better focus on tricep involvement. Lower yourself until there is a 90 degree angle formed between the upper arm and forearm.","Then, exhale and push your torso back up using your triceps to bring your body back to the starting position."]},
{"url":"nEF0bv2FW94","name":"Close-Grip Barbell Bench Press","wanted":1,"mg":0,"rep":8,"set":3,"weight":20,"muscle":0,"steps":["Lie back on a flat bench. Using a close grip (around shoulder width), lift the bar from the rack and hold it straight over you with your arms locked. This will be your starting position.","As you breathe in, come down slowly until you feel the bar on your middle chest. Tip: Make sure that - as opposed to a regular bench press - you keep the elbows close to the torso at all times in order to maximize triceps involvement.","After a second pause, bring the bar back to the starting position as you breathe out and push the bar using your triceps muscles. Lock your arms in the contracted position, hold for a second and then start coming down slowly again. Tip: It should take at least twice as long to go down than to come up."]},
{"url":"-4RNtxT0LwM","name":"Spider Curl","wanted":1,"mg":0,"rep":8,"set":3,"weight":20,"muscle":0,"steps":["Start out by setting the bar on the part of the preacher bench that you would normally sit on. Make sure to align the barbell properly so that it is balanced and will not fall off.","Move to the front side of the preacher bench (the part where the arms usually lay) and position yourself to lay at a 45 degree slant with your torso and stomach pressed against the front side of the preacher bench.","Make sure that your feet (especially the toes) are well positioned on the floor and place your upper arms on top of the pad located on the inside part of the preacher bench.","Use your arms to grab the barbell with a supinated grip (palms facing up) at about shoulder width apart or slightly closer from each other.","Slowly begin to lift the barbell upwards and exhale. Hold the contracted position for a second as you squeeze the biceps.","Slowly begin to bring the barbell back to the starting position as your breathe in."]},
{"url":"BL8LbVuVCbE","name":"Wrist Rotations with Straight Bar","wanted":1,"mg":0,"rep":8,"set":3,"weight":20,"muscle":0,"steps":["Hold a barbell with both hands and your palms facing down; hands spaced about shoulder width. This will be your starting position.","Alternating between each of your hands, perform the movement by extending the wrist as though you were rolling up a newspaper. Continue alternating back and forth until failure.","Reverse the motion by flexing the wrist, rolling the opposite direction. Continue the alternating motion until failure."]},
{"url":"ykJmrZ5v0Oo","name":"Dumbbell Biceps Curl","wanted":1,"mg":0,"rep":8,"set":3,"weight":20,"muscle":0,"steps":["Stand up straight with a dumbbell in each hand at arm's length. Keep your elbows close to your torso and rotate the palms of your hands until they are facing forward. This will be your starting position.","Now, keeping the upper arms stationary, exhale and curl the weights while contracting your biceps. Continue to raise the weights until your biceps are fully contracted and the dumbbells are at shoulder level. Hold the contracted position for a brief pause as you squeeze your biceps.","Then, inhale and slowly begin to lower the dumbbells back to the starting position."]},
{"url":"pSHjTRCQxIw","name":"Plank","wanted":1,"mg":4,"rep":8,"set":3,"weight":20,"muscle":0,"steps":["Get into a prone position on the floor, supporting your weight on your toes and your forearms. Your arms are bent and directly below the shoulder.","Keep your body straight at all times, and hold this position as long as possible. To increase difficulty, an arm or leg can be raised."]},
{"url":"ph3pddpKzzw","name":"Hyperextensions (Back Extensions)","wanted":1,"mg":3,"rep":8,"set":3,"weight":20,"muscle":0,"steps":["Lie face down on a hyperextension bench, tucking your ankles securely under the footpads","With your body straight, cross your arms in front of you (my preference) or behind your head. This will be your starting position","Start bending forward slowly at the waist as far as you can while keeping your back flat. Inhale as you perform this movement.","Slowly raise your torso back to the initial position as you inhale."]},
{"url":"lMBKFUfJw9o","name":"Reverse Grip Bent-Over Rows","wanted":1,"mg":3,"rep":8,"set":3,"weight":20,"muscle":1,"steps":["Stand erect while holding a barbell with a supinated grip (palms facing up).","Bend your knees slightly and bring your torso forward, by bending at the waist, while keeping the back straight until it is almost parallel to the floor.","While keeping the torso stationary, lift the barbell as you breathe out, keeping the elbows close to the body and not doing any force with the forearm other than holding the weights. On the top contracted position, squeeze the back muscles and hold for a second."]},
{"url":"iUNoLR0pYjY","name":"Pull Up","wanted":1,"mg":3,"rep":8,"set":3,"weight":20,"muscle":2,"steps":["Grab the pull-up bar with the palms facing forward using the prescribed grip.","As you have both arms extended in front of you holding the bar at the chosen grip width, bring your torso back around 30 degrees or so while creating a curvature on your lower back and sticking your chest out.","Pull your torso up until the bar touches your upper chest by drawing the shoulders and the upper arms down and back. Exhale as you perform this portion of the movement.","After a second on the contracted position, start to inhale and slowly lower your torso back to the starting position when your arms are fully extended and the lats are fully stretched."]},
{"url":"lueEJGjTuPQ","name":"Wide-Grip Lat Pulldown","wanted":1,"mg":3,"rep":8,"set":3,"weight":20,"muscle":2,"steps":["Sit down on a pull-down machine with a wide bar attached to the top pulley. Make sure that you adjust the knee pad of the machine to fit your height. These pads will prevent your body from being raised by the resistance attached to the bar.","Grab the bar with the palms facing forward using the prescribed grip.","As you have both arms extended in front of you holding the bar at the chosen grip width, bring your torso back around 30 degrees or so while creating a curvature on your lower back and sticking your chest out. This is your starting position.","As you breathe out, bring the bar down until it touches your upper chest by drawing the shoulders and the upper arms down and back.","After a second at the contracted position squeezing your shoulder blades together, slowly raise the bar back to the starting position when your arms are fully extended and the lats are fully stretched. Inhale during this portion of the movement."]},
{"url":"KDEl3AmZbVE","name":"T-Bar Row with Handle","wanted":1,"mg":3,"rep":8,"set":3,"weight":20,"muscle":1,"steps":["Position a bar into a landmine or in a corner to keep it from moving. Load an appropriate weight onto your end.","Stand over the bar, and position a Double D row handle around the bar next to the collar. Using your hips and legs, rise to a standing position.","Assume a wide stance with your hips back and your chest up. Your arms should be extended. This will be your starting position.","Pull the weight to your upper abdomen by retracting the shoulder blades and flexing the elbows. Do not jerk the weight or cheat during the movement.","After a brief pause, return to the starting position."]},
{"url":"CpWsUsqBtN8","name":"Deficit Deadlift","wanted":1,"mg":3,"rep":8,"set":3,"weight":20,"muscle":0,"steps":["Begin by having a platform or weight plates that you can stand on, usually 1-3 inches in height. Approach the bar so that it is centered over your feet. You feet should be about hip width apart. Bend at the hip to grip the bar at shoulder width, allowing your shoulder blades to protract. Typically, you would use an overhand grip or an over/under grip on heavier sets.","With your feet, and your grip set, take a big breath and then lower your hips and bend the knees until your shins contact the bar. Look forward with your head, keep your chest up and your back arched, and begin driving through the heels to move the weight upward. After the bar passes the knees, aggressively pull the bar back, pulling your shoulder blades together as you drive your hips forward into the bar.","Lower the bar by bending at the hips and guiding it to the floor."]},
{"url":"cT5_GyOXIgE","name":"Smith Machine Shrug","wanted":1,"mg":3,"rep":8,"set":3,"weight":20,"muscle":3,"steps":["To begin, set the bar height on the smith machine around the middle of your thighs. Once the correct height is chosen and the bar is loaded, grab the bar using a pronated grip (palms facing you) shoulder width apart from each other.","Lift the barbell up and fully extend your arms with your back straight. This is the starting position.","While exhaling, elevate the bar by raising your shoulders until they come close to touching your ears.","Hold the contraction for a second before lowering the bar back down to the starting position while inhaling."]}]
